reports/showcase_aero/_v71b_bfs_lowre_probe/case_definition/0/nut
/*--------------------------------*- C++ -*---------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  10                                    |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    outlet
    {
        type            zeroGradient;
    }
    lower_wall
    {
        // DEC-V61-052: Spalding-form blending wall function spans viscous
        // sublayer (y+<5), buffer (5<y+<30), and log region. First B1
        // near-wall cell at ncy_B1=40 has y+≈5 under BFS Re=7600, so
        // nutkWallFunction (log-only) would give nonsense.
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    upper_wall
    {
        // DEC-V61-052: Spalding-form blending wall function spans viscous
        // sublayer (y+<5), buffer (5<y+<30), and log region. First B1
        // near-wall cell at ncy_B1=40 has y+≈5 under BFS Re=7600, so
        // nutkWallFunction (log-only) would give nonsense.
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
