reports/showcase_aero/_v71b_bfs_lowre_probe/case_definition/system/fvSchemes
/*--------------------------------*- C++ -*---------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  10                                    |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    // DEC-V61-052: BFS k-ε is unconditionally unstable under central-differenced
    // convection at the recirculation shear layer. Switch to bounded Gauss
    // linearUpwind for momentum (TVD-like, still 2nd-order in smooth regions)
    // and bounded upwind for turbulence scalars (keeps k, ε non-negative).
    div(phi,U)      bounded Gauss linearUpwind grad(U);
    div(phi,k)      bounded Gauss upwind;
    div(phi,epsilon) bounded Gauss upwind;
    div(phi,omega)  bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// kOmegaSST needs wallDist for its F1/F2 blending functions. `meshWave`
// is the standard PDE-free iterative wall-distance solver in OpenFOAM
// 10. Harmless when kEpsilon is active (key is only read if requested).
wallDist
{
    method          meshWave;
}

// ************************************************************************* //
